{
  "users": [
    {
      "id": "001",
      "login": "maria",
      "password": "123456",
      "registed_at": "2050-09-22",
      "role_id": 0
    },
    {
      "login": "ivasha",
      "password": "123456",
      "registed_at": "2024-01-17",
      "role_id": 2,
      "id": "D5cGi6B"
    },
    {
      "login": "kolya",
      "password": "123456",
      "registed_at": "2024-01-27",
      "role_id": 2,
      "id": "B26GM1o"
    },
    {
      "login": "nadejda",
      "password": "123456",
      "registed_at": "2024-01-29",
      "role_id": 1,
      "id": "nhQIm2l"
    }
  ],
  "roles": [
    {
      "id": 0,
      "name": "Администратор"
    },
    {
      "id": 1,
      "name": "Модератор"
    },
    {
      "id": 2,
      "name": "Читатель"
    },
    {
      "id": 3,
      "name": "Гость"
    }
  ],
  "rooms": [
    {
      "id": 1,
      "title": "Капсульные номера",
      "image_url": "https://images.squarespace-cdn.com/content/v1/5e0049ae776e4d0673bb06f2/ec48c46c-1c93-42ae-afb6-ea61f8b50722/Room-20210401-002-id556-Hires_6000px.jpg",
      "price": "4 000",
      "content": "Капсульный номер - идеальный выбор для тех, кто ценит комфорт, компактность и современный дизайн. В этом небольшом, но функциональном пространстве есть все необходимое для приятного и спокойного отдыха после насыщенного дня. \n \n Интерьер номера выполнен в нейтральных тонах, что создает атмосферу уюта и спокойствия.  Мягкое освещение и удобные матрасы на верхних и нижних койках обеспечивают комфортный сон. В номере также имеется индивидуальный шкафчик для хранения вещей, столик для работы и отдыха, а также розетка для зарядки электронных устройств. \n \n Ванная комната оснащена всеми необходимыми принадлежностями, такими как полотенца, фен, шампунь, гель для душа и мыло. Кроме того, в номере установлен кондиционер для поддержания комфортной температуры и шумоизолирующие окна для спокойного сна. \n \n Капсульный номер предлагает своим гостям возможность насладиться тишиной и покоем, находясь в центре городской суеты. Идеально подходит для путешественников, ищущих уютное и недорогое место для ночлега."
    },
    {
      "id": 2,
      "title": "Номер Стандарт",
      "image_url": "https://bron-top.ru/-/f/hotels/photos/21374/2000x2000q60/21-2.jpg",
      "price": "10 000",
      "content": "Номер «Стандарт» - идеальное решение для комфортного проживания во время путешествия или деловой поездки. Этот просторный и светлый номер оснащен всем необходимым для приятного отдыха после напряженного дня. \n \n В номере имеется удобная двуспальная кровать с ортопедическим матрасом, которая обеспечит вам крепкий и здоровый сон. Также в номере присутствует необходимая мебель, включая шкаф для одежды, тумбочки и письменный стол. Для вашего комфорта в номере установлен кондиционер, который позволит поддерживать оптимальную температуру в любое время года. \n \n Ванная комната оборудована современной сантехникой и укомплектована всем необходимым – от набора полотенец до косметических принадлежностей. \n \n Расположение номера позволит вам без труда добраться до основных достопримечательностей и деловых центров города. Рядом с отелем находится множество кафе, ресторанов и магазинов."
    },
    {
      "id": 3,
      "title": "Номер Комфорт",
      "image_url": "https://m1.online-agent.ru/description/imagescache/3f/3f7fa9ad96a69cccddc0668e330158b7.jpg",
      "price": "15 000",
      "content": "Номер “Комфорт” - это идеальное сочетание уюта, функциональности и современного дизайна. Он идеально подойдет для тех, кто ценит качество и удобство в своем путешествии. \n \n Данный номер оснащен всем самым необходимым для комфортного проживания: удобной двуспальной кроватью с ортопедическим матрасом, вместительным шкафом для одежды, письменным столом и мягким креслом. Также в вашем распоряжении будет ЖК-телевизор с кабельными каналами, мини-бар и Wi-Fi. Ванная комната порадует вас современной сантехникой, набором мягких полотенец и косметическими принадлежностями.\n \n Безопасность в номере обеспечивается благодаря системе электронных замков и круглосуточному видеонаблюдению на всей территории отеля.\n \n Удачное расположение номера позволит легко добраться до всех достопримечательностей и важных объектов города. В шаговой доступности находятся кафе, рестораны, магазины и развлекательные центры."
    },
    {
      "id": 4,
      "title": "Номер Полулюкс",
      "image_url": "https://imgcy.trivago.com/c_fill,d_dummy.jpeg,e_sharpen:60,f_auto,h_627,q_auto,w_1200/itemimages/18/42/1842929_v6.jpeg",
      "price": "20 000",
      "content": "Номер “Полулюкс” - идеальное сочетание комфорта и функциональности для путешественников, ценящих уют и стиль. Расположенный на верхних этажах здания, номер предлагает захватывающий вид на город.\n \n Элегантно оформленная комната оснащена удобной двуспальной кроватью с ортопедическим матрасом и белоснежным постельным бельем, а также мягким диваном для отдыха и чтения. Ванная комната оборудована современной сантехникой, включая ванну и душевую кабину, а также предоставляется набор эксклюзивных косметических средств.\n \n В номере также имеется рабочий стол с эргономичным креслом, мини-бар с безалкогольными напитками и бутилированной водой, а также сейф для хранения ценных вещей. Для приятного времяпрепровождения в номере установлен ЖК-телевизор со спутниковыми каналами и высокоскоростной Wi-Fi.\n \n Номер класса “полулюкс” предлагает гостям расширенный спектр услуг и удобств, таких как круглосуточное обслуживание номеров, ежедневная уборка, бесплатная парковка и возможность раннего заезда или позднего выезда (при наличии свободных номеров).\n \n Этот роскошный номер станет идеальным выбором для тех, кто ценит комфорт и хочет насладиться атмосферой уюта и гостеприимства во время своего пребывания в отеле."
    },
    {
      "id": 5,
      "title": "Номер Люкс",
      "image_url": "https://cdn.worldota.net/t/1024x768/extranet/e2/a9/e2a90e0c38d9b7ac2d8a7b510a860e4c2f2879e9.jpeg",
      "price": "45 000",
      "content": "Номер отеля класса «Люкс» - это роскошные апартаменты, которые созданы для максимального комфорта и удобства гостей. Этот просторный номер включает в себя несколько комнат, каждая из которых оформлена в уникальном стиле и имеет свое функциональное назначение.\n \n Главная комната номера - это просторная гостиная, которая оборудована мягкой мебелью, обеденным столом на несколько персон, а также большим ЖК-телевизором с широким выбором кабельных каналов. Здесь гости могут насладиться просмотром любимых передач, а также провести время в приятной беседе за чашечкой кофе или чая.\n\n Спальня номера оснащена большой кроватью с ортопедическим матрасом и мягкими подушками, что обеспечивает комфортный сон и отдых после насыщенного дня. Также здесь имеется вместительный шкаф для одежды и туалетный столик с зеркалом.\n\n Кухня оборудована всем необходимым для приготовления пищи: плитой, микроволновой печью, холодильником, а также полным набором посуды и столовых приборов. Это позволяет гостям наслаждаться домашней едой, не выходя из номера.\n\n Ванная комната номера класса «Люкс» выполнена в современном стиле и оснащена джакузи, душевой кабиной, биде и другими удобствами для комфортного принятия водных процедур. Кроме того, здесь имеется фен, набор мягких полотенец, халаты и косметические принадлежности для полноценного ухода за кожей и волосами."
    },
    {
      "id": 6,
      "title": "Номер Президентский",
      "image_url": "https://i08.fotocdn.net/s128/52f92d24a1fe4445/public_pin_l/2903062275.jpg",
      "price": "100 000",
      "content": "Президентский люкс – это воплощение роскоши и комфорта, созданное для самых взыскательных гостей. Расположенный на верхнем этаже нашего отеля, этот номер предлагает непревзойденный вид на окрестности и обеспечивает абсолютную приватность. \n \n Дизайн интерьера выполнен с использованием натуральных материалов, таких как дерево и камень. Просторная гостиная с камином и обеденным столом идеально подходит для проведения деловых встреч или семейных обедов. \n\n Главная спальня с кроватью размера King оснащена высококачественным ортопедическим матрасом и роскошными постельными принадлежностями. Встроенный шкаф и большое зеркало с подсветкой обеспечивают достаточно места для хранения вещей и комфортного переодевания. Ванная комната с джакузи и отдельной душевой кабиной оснащена эксклюзивной косметикой и мягкими полотенцами. \n\n В президентском люксе также имеется полностью оборудованный рабочий кабинет, отдельная комната для прислуги и персональный дворецкий."
    }
  ],
  "reservations": [
    {
      "author_id": "maria",
      "room_id": "001",
      "options": "1",
      "arrival_date": "2024-01-28",
      "leaving_date": "2024-01-31",
      "id": 21
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "1",
      "arrival_date": "2024-01-28",
      "leaving_date": "2024-01-31",
      "id": 22
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "4",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 23
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "5",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 24
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "6",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 25
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "6",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 26
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "7",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 27
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "10",
      "arrival_date": "2024-01-31",
      "leaving_date": "2024-02-03",
      "id": 28
    },
    {
      "author_id": "maria",
      "room_id": "006",
      "options": "1",
      "arrival_date": "2024-01-30",
      "leaving_date": "2024-01-31",
      "id": 29
    },
    {
      "author_id": "maria",
      "room_id": "001",
      "options": "1",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 30
    },
    {
      "author_id": "maria",
      "room_id": "003",
      "options": "2",
      "arrival_date": "2024-01-29",
      "leaving_date": "2024-01-31",
      "id": 31
    },
    {
      "author_id": "nadejda",
      "room_id": "004",
      "options": "2",
      "arrival_date": "2024-01-31",
      "leaving_date": "2024-02-23",
      "id": 33
    },
    {
      "author_id": "nadejda",
      "room_id": "004",
      "options": "1",
      "arrival_date": "2024-02-01",
      "leaving_date": "2024-02-23",
      "id": 34
    },
    {
      "author_id": "nadejda",
      "room_id": "003",
      "options": "2",
      "arrival_date": "2024-02-01",
      "leaving_date": "2024-02-14",
      "id": 35
    },
    {
      "author_id": "nadejda",
      "room_id": "003",
      "options": "2",
      "arrival_date": "2024-02-08",
      "leaving_date": "2024-02-28",
      "id": 36
    }
  ]
}
